init.org
* init.el
:PROPERTIES:
:header-args: :comments link :tangle init.el
:END:
** Introduction
Nothing is ever officially underway until a legal disclaimer of some
sort is produced
#+BEGIN_SRC emacs-lisp
    ;;; .emacs.el

    ;;; Commentary:
    ;;; This is the .emacs file written and used by esc. The .el file is
    ;;; not the original form of this document; it was written in org
    ;;; babel. If you are not viewing the org document, you should try to
    ;;; locate it. It's much nicer to humans.

    ;;; License:
    ;;; esc's .emacs configuration file, for a smoother Emacs experience.
    ;;; Copyright (C) 2013 Eric Crosson
    ;;;
    ;;; This program is free software: you can redistribute it and/or modify
    ;;; it under the terms of the GNU General Public License as published by
    ;;; the Free Software Foundation, either version 3 of the License, or
    ;;; (at your option) any later version.
    ;;;
    ;;; This program is distributed in the hope that it will be useful,
    ;;; but WITHOUT ANY WARRANTY; without even the implied warranty of
    ;;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
    ;;; GNU General Public License for more details.
    ;;;
    ;;; You should have received a copy of the GNU General Public License
    ;;; along with this program. If not, see <http://www.gnu.org/licenses/>.

    ;;; Code:
#+END_SRC
*** User data
  Hello, My Name Is
  #+BEGIN_SRC emacs-lisp
  (setq user-full-name "Amchelle Clendenin"
        user-mail-address "amchelle@protonmail.com")
  #+END_SRC
*** ratpoison
#+BEGIN_SRC emacs-lisp
  (when window-system
    (mapc (lambda (mode) (when (fboundp mode) (funcall mode -1)))
          '(menu-bar-mode
            tool-bar-mode
            scroll-bar-mode)))
#+END_SRC
** Package management
*** Archives
Configure remote package archives
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-enable-at-startup nil)
      (mapc (lambda (source) (add-to-list 'package-archives source) t)
            '(("gnu" . "http://elpa.gnu.org/packages/")
              ("melpa-stable" . "http://melpa-stable.milkbox.net/packages/")
              ("melpa" . "http://melpa.milkbox.net/packages/")
              ("org" . "http://orgmode.org/elpa/")))
  ;; (package-initialize)
#+END_SRC
*** Use-package
First there was =use-package=
#+BEGIN_SRC emacs-lisp
;; Bootstrap `use-package'
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
#+END_SRC

** Layout and load paths
  #+BEGIN_SRC emacs-lisp
  (defcustom esc-meta-directory "~/.emacs.d/meta/"
    "Path to .emacs.d meta directory, for internal bookkeeping
  records."
    :type 'path
    :options '("~/.emacs.d/meta")
    :group 'esc-init)
  #+END_SRC

** UI
We must always remember [[http://programmers.stackexchange.com/a/148678][our origins]]
#+BEGIN_SRC emacs-lisp
    (use-package fill-column-indicator :ensure t
      :config
      (add-hook 'prog-mode-hook 'fci-mode))
#+END_SRC

*** Fonts
#+BEGIN_SRC emacs-lisp
  (defun font-exists-p (font)
    "True FONT is recognized by Emacs, nil otherwise."
    (member esc-font (font-family-list)))
#+END_SRC

Favored font of late
#+BEGIN_SRC emacs-lisp
  (let ((esc-font "Source Code Pro"))
    ;; install `esc-font`
    (when (not (font-exists-p esc-font))
      (call-process
       (expand-file-name "font-install-source-code-pro.sh"
                         "~/.emacs.d/bin")))
    ;; use `esc-font`
    (when (font-exists-p esc-font)
      (set-face-attribute 'default nil
                          :font esc-font
                          :height 95
                          :weight 'normal
                          :width 'normal)))
#+END_SRC
*** Themes
Nord theme
#+BEGIN_SRC emacs-lisp :tangle no
      (use-package nord-theme :ensure t
        :config
        (load-theme 'nord t)
        (set-face-foreground 'font-lock-comment-face "#b3daff")
        (set-face-foreground 'font-lock-doc-face "#B4C4C8"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package dracula-theme
    :ensure t
    :pin melpa-stable
    :config (load-theme 'dracula t))
#+END_SRC

Possible light-themes:
  - snowish theme
  - mistyday theme

** Macros
  I took the macro below from [[http://milkbox.net/note/single-file-master-emacs-configuration/][milkypostman]]. His article is really worth
  a read; stop what you're doing and go take a look if you haven't.
  #+BEGIN_SRC emacs-lisp
(defmacro after (mode &rest body)
  "`eval-after-load' MODE evaluate BODY."
  (declare (indent defun))
  `(eval-after-load ,mode
     '(progn ,@body)))
  #+END_SRC
  
** Functions
The Alt-Tab of buffers
#+BEGIN_SRC emacs-lisp
  (defun switch-to-previous-buffer ()
    "Switch to previously open buffer.
  Repeated invocations toggle between the two most recently opened buffers."
    (interactive)
    (switch-to-buffer (other-buffer (current-buffer) 1)))
#+END_SRC

Anything I end up doing more than three times...
#+BEGIN_SRC emacs-lisp
  (defun insert-program-header ()
    "Insert the user's name and the current date at point."
    (interactive)
    (insert "Written by " user-full-name)
    (open-line 1)
    (comment-line 1)
    (esc-insert-short-date)
    (comment-line 1))

  (defun esc-insert-timestamp ()
        "Insert timestamp at point in YYYY-MM-DD|HH:MM (UTC time)"
        (interactive)
        (insert (format-time-string "%Y-%m-%d|%H:%M" nil t)))
#+END_SRC

** Aliases
I did not grow up in an era where this is a straightforward mnemonic
#+BEGIN_SRC emacs-lisp
  (defalias 'undefun 'fmakunbound)
#+END_SRC

