init.el
;; [[file:~/.emacs.d/init.org::*Introduction][Introduction:1]]
;;; .emacs.el

;;; Commentary:
;;; This is the .emacs file written and used by esc. The .el file is
;;; not the original form of this document; it was written in org
;;; babel. If you are not viewing the org document, you should try to
;;; locate it. It's much nicer to humans.

;;; License:
;;; esc's .emacs configuration file, for a smoother Emacs experience.
;;; Copyright (C) 2013 Eric Crosson
;;;
;;; This program is free software: you can redistribute it and/or modify
;;; it under the terms of the GNU General Public License as published by
;;; the Free Software Foundation, either version 3 of the License, or
;;; (at your option) any later version.
;;;
;;; This program is distributed in the hope that it will be useful,
;;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
;;; GNU General Public License for more details.
;;;
;;; You should have received a copy of the GNU General Public License
;;; along with this program. If not, see <http://www.gnu.org/licenses/>.

;;; Code:
;; Introduction:1 ends here

;; [[file:~/.emacs.d/init.org::*User%20data][User data:1]]
(setq user-full-name "Amchelle Clendenin"
      user-mail-address "amchelle@protonmail.com")
;; User data:1 ends here

;; [[file:~/.emacs.d/init.org::*Archives][Archives:1]]
(require 'package)
(setq package-enable-at-startup nil)
    (mapc (lambda (source) (add-to-list 'package-archives source) t)
          '(("gnu" . "http://elpa.gnu.org/packages/")
            ("marmalade" . "http://marmalade-repo.org/packages/")
            ("melpa-stable" . "http://melpa-stable.milkbox.net/packages/")
            ("melpa" . "http://melpa.milkbox.net/packages/")
            ("org" . "http://orgmode.org/elpa/")))
;; (package-initialize)
;; Archives:1 ends here

;; [[file:~/.emacs.d/init.org::*Use-package][Use-package:1]]
;; Bootstrap `use-package'
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
;; Use-package:1 ends here

;; [[file:~/.emacs.d/init.org::*Layout%20and%20load%20paths][Layout and load paths:1]]
(defcustom esc-meta-directory "~/.emacs.d/meta/"
  "Path to .emacs.d meta directory, for internal bookkeeping
records."
  :type 'path
  :options '("~/.emacs.d/meta")
  :group 'esc-init)
;; Layout and load paths:1 ends here

;; [[file:~/.emacs.d/init.org::*UI][UI:1]]
(use-package fill-column-indicator :ensure t
  :config
  (add-hook 'prog-mode-hook 'fci-mode))
;; UI:1 ends here

;; [[file:~/.emacs.d/init.org::*Fonts][Fonts:1]]
(defun font-exists-p (font)
  "True FONT is recognized by Emacs, nil otherwise."
  (member esc-font (font-family-list)))
;; Fonts:1 ends here

;; [[file:~/.emacs.d/init.org::*Fonts][Fonts:2]]
(let ((esc-font "Source Code Pro"))
  ;; install `esc-font`
  (when (not (font-exists-p esc-font))
    (call-process
     (expand-file-name "font-install-source-code-pro.sh"
                       "~/.emacs.d/bin")))
  ;; use `esc-font`
  (when (font-exists-p esc-font)
    (set-face-attribute 'default nil
                        :font esc-font
                        :height 95
                        :weight 'normal
                        :width 'normal)))
;; Fonts:2 ends here

;; [[file:~/.emacs.d/init.org::*Themes][Themes:2]]
(use-package darkokai-theme :ensure t
  :config
  (setq darkokai-mode-line-padding 1))
;; Themes:2 ends here

;; [[file:~/.emacs.d/init.org::*Themes][Themes:4]]
(use-package nord-theme :ensure t
  :config
  (load-theme 'nord t))
;; Themes:4 ends here

;; [[file:~/.emacs.d/init.org::*Macros][Macros:1]]
(defmacro after (mode &rest body)
  "`eval-after-load' MODE evaluate BODY."
  (declare (indent defun))
  `(eval-after-load ,mode
     '(progn ,@body)))
;; Macros:1 ends here

;; [[file:~/.emacs.d/init.org::*Functions][Functions:1]]
(defun switch-to-previous-buffer ()
  "Switch to previously open buffer.
Repeated invocations toggle between the two most recently opened buffers."
  (interactive)
  (switch-to-buffer (other-buffer (current-buffer) 1)))
;; Functions:1 ends here

;; [[file:~/.emacs.d/init.org::*Functions][Functions:2]]
(defun insert-program-header ()
  "Insert the user's name and the current date at point."
  (interactive)
  (insert "Written by " user-full-name)
  (open-line 1)
  (comment-line 1)
  (esc-insert-short-date)
  (comment-line 1))
;; Functions:2 ends here

;; [[file:~/.emacs.d/init.org::*Aliases][Aliases:1]]
(defalias 'undefun 'fmakunbound)
;; Aliases:1 ends here
