init.org
** Behavioral modifications
  #+BEGIN_SRC emacs-lisp
  (setq gc-cons-threshold 100000000)
  (put 'overwrite-mode 'disabled t)       ;There shall be no 'insert'
  (fset 'yes-or-no-p 'y-or-n-p)           ;change yes-no to y-n
  (setq ;debug-on-error t
        inhibit-startup-screen t
        initial-scratch-message nil
        ring-bell-function 'ignore        ;turn off alarms completely
        disabled-command-function 'beep   ;alert me when accessing disabled funcs
        redisplay-dont-pause t            ;don't pause refreshes
        frame-title-format '("emacs@" system-name ":%f") ;include path of frame
        display-time-load-average-threshold 0.6
        dabbrev-case-replace nil
        display-buffer-reuse-frames t     ;raise buffers, not spawn
        remote-file-name-inhibit-cache t  ;don't resolve remote file attrubutes
        auto-save-default nil
        large-file-warning-threshold nil
        save-interprogram-paste-before-kill t
        set-mark-command-repeat-pop t
        starttls-use-gnutls t
        vc-follow-symlinks t
        browse-url-browser-function 'browse-web
        kill-buffer-query-functions (remq 'process-kill-buffer-query-function
                                           kill-buffer-query-functions))
  #+END_SRC

Now everybody agrees that the =*Minibuffer*= prompt is uneditable
#+BEGIN_SRC emacs-lisp
  (setq minibuffer-prompt-properties '(read-only t point-entered
                                                 minibuffer-avoid-prompt face
                                                 minibuffer-prompt))
#+END_SRC

Line numbers, when visible, should be loaded after a short delay and
not loaded eagerly. They're candy, and who spends resources acquiring
candy?
#+BEGIN_SRC emacs-lisp :tangle no
  (setq linum-delay t
        linum-eager nil)
#+END_SRC

These settings keep the text soup that is GNU/Linux as happy as
GNU/Linux files can be
#+NAME: char-and-font-encoding
#+BEGIN_SRC emacs-lisp
  ;; Char and font encoding
  (set-buffer-file-coding-system 'unix)
  (setq-default indent-tabs-mode nil)
  (setq c-default-style "linux"
        c-basic-offset 4
        tab-width 4
        require-final-newline 'visit-save ;compliance
        comment-style 'indent)
#+END_SRC

It is my belief that backup files should not be so obtrusive as to
tempt users to disable them.
#+NAME: stash-backups
#+BEGIN_SRC emacs-lisp
  (push '("." . "~/.config/.emacs.d/") backup-directory-alist)
#+END_SRC

Keep me informed
#+BEGIN_SRC emacs-lisp
    (global-auto-revert-mode)
#+END_SRC

=i-search= is capable of spanning whitespace regions
#+BEGIN_SRC emacs-lisp
  (setq search-whitespace-regexp "[ \t\r\n]+")
#+END_SRC

Avoid accidental termination
#+BEGIN_SRC emacs-lisp
   (bind-key (kbd "C-x C-c")
             (defun esc-dont-kill-emacs ()
               (interactive)
               (message "I'm afraid I can't do that, %s."
                        (user-login-name))))
#+END_SRC

Share the Xorg clipboard and at point, not at the middle-click
location
#+BEGIN_SRC emacs-lisp
  (setq x-select-enable-clipboard t
        mouse-yank-at-point t)
#+END_SRC

** Core
*** Org mode config

#+BEGIN_SRC emacs-lisp
   (setq org-src-fontify-natively t)
#+END_SRC

**** Org indent config
#+BEGIN_SRC emacs-lisp
   (add-hook 'org-mode-hook 'org-indent-mode)
   (add-hook 'org-mode-hook 'auto-fill-mode)
   (add-hook 'org-mode-hook 'flyspell-mode)
#+END_SRC
**** Org cliplink config
#+BEGIN_SRC emacs-lisp
  (use-package org-cliplink :ensure t
    :init (after 'esc-mode
            (esc-key "C-c C-M-l" 'org-cliplink)))
#+END_SRC
**** Org bullets
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets :ensure t
    :init (add-hook 'org-mode-hook 'org-bullets-mode))
#+END_SRC
**** Org toc config
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package toc-org :ensure t
    :init
    (add-hook 'org-mode-hook 'toc-org-enable))
#+END_SRC

**** Org babel config
#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)))
#+END_SRC
**** Org gtd
#+BEGIN_SRC emacs-lisp
  (after 'org
    (setq org-todo-keywords
          '((sequence "TODO(t!/@)" "HOLD(h@)" "NEXT(n!)" "INPROG(i!)"
                      "WAITING(w@)" "REVIEW(r@)" "|"
                      "DONE(d@)" "CANCELLED(c@)")
            (sequence "|" "PLAN(p!)" "MEETING(m!)")
            (sequence "PROJECT(r!)" "|" "DONE(d@)" "CANCELLED(c@)")))
    (setq org-todo-keyword-faces
          '(("TODO" :foreground "red" :weight bold)
            ("REVIEW" :foreground "orange" :weight bold)
            ("NEXT" :foreground "orange" :weight bold)
            ("INPROG" :foreground "orange" :weight bold)
            ("HOLD" :foreground "orange" :weight bold)
            ("WAITING" :foreground "orange" :weight bold)
            ("DONE" org-done)
            ("CANCELLED" org-done)
            ("PROJECT" :foreground "purple" :weight bold)
            ("PLAN" :foreground "purple" :weight bold)
            ("MEETING" :foreground "blue" :weight bold))))
#+END_SRC
