init.el

;; [[file:~/.emacs.d/init.org::*Behavioral%20modifications][Behavioral modifications:1]]
(setq gc-cons-threshold 100000000)
(put 'overwrite-mode 'disabled t)       ;There shall be no 'insert'
(fset 'yes-or-no-p 'y-or-n-p)           ;change yes-no to y-n
(setq ;debug-on-error t
      inhibit-startup-screen t
      initial-scratch-message nil
      ring-bell-function 'ignore        ;turn off alarms completely
      disabled-command-function 'beep   ;alert me when accessing disabled funcs
      redisplay-dont-pause t            ;don't pause refreshes
      frame-title-format '("emacs@" system-name ":%f") ;include path of frame
      display-time-load-average-threshold 0.6
      dabbrev-case-replace nil
      display-buffer-reuse-frames t     ;raise buffers, not spawn
      remote-file-name-inhibit-cache t  ;don't resolve remote file attrubutes
      auto-save-default nil
      large-file-warning-threshold nil
      save-interprogram-paste-before-kill t
      set-mark-command-repeat-pop t
      starttls-use-gnutls t
      vc-follow-symlinks t
      browse-url-browser-function 'browse-web
      kill-buffer-query-functions (remq 'process-kill-buffer-query-function
                                         kill-buffer-query-functions))
;; Behavioral modifications:1 ends here

;; [[file:~/.emacs.d/init.org::*Behavioral%20modifications][Behavioral modifications:2]]
(setq minibuffer-prompt-properties '(read-only t point-entered
                                               minibuffer-avoid-prompt face
                                               minibuffer-prompt))
;; Behavioral modifications:2 ends here

;; [[file:~/.emacs.d/init.org::char-and-font-encoding][char-and-font-encoding]]
;; Char and font encoding
(set-buffer-file-coding-system 'unix)
(setq-default indent-tabs-mode nil)
(setq c-default-style "linux"
      c-basic-offset 4
      tab-width 4
      require-final-newline 'visit-save ;compliance
      comment-style 'indent)
;; char-and-font-encoding ends here

;; [[file:~/.emacs.d/init.org::stash-backups][stash-backups]]
(push '("." . "~/.config/.emacs.d/") backup-directory-alist)
;; stash-backups ends here

;; [[file:~/.emacs.d/init.org::*Behavioral%20modifications][Behavioral modifications:6]]
(global-auto-revert-mode)
;; Behavioral modifications:6 ends here

;; [[file:~/.emacs.d/init.org::*Behavioral%20modifications][Behavioral modifications:7]]
(setq search-whitespace-regexp "[ \t\r\n]+")
;; Behavioral modifications:7 ends here

;; [[file:~/.emacs.d/init.org::*Behavioral%20modifications][Behavioral modifications:8]]
(bind-key (kbd "C-x C-c")
          (defun esc-dont-kill-emacs ()
            (interactive)
            (message "I'm afraid I can't do that, %s."
                     (user-login-name))))
;; Behavioral modifications:8 ends here

;; [[file:~/.emacs.d/init.org::*Behavioral%20modifications][Behavioral modifications:9]]
(setq x-select-enable-clipboard t
      mouse-yank-at-point t)
;; Behavioral modifications:9 ends here

;; [[file:~/.emacs.d/init.org::*Org%20mode%20config][Org mode config:1]]
(setq org-src-fontify-natively t)
;; Org mode config:1 ends here

;; [[file:~/.emacs.d/init.org::*Org%20indent%20config][Org indent config:1]]
(add-hook 'org-mode-hook 'org-indent-mode)
(add-hook 'org-mode-hook 'auto-fill-mode)
;; Org indent config:1 ends here

;; [[file:~/.emacs.d/init.org::*Org%20cliplink%20config][Org cliplink config:1]]
(use-package org-cliplink :ensure t
  :init (after 'esc-mode
          (esc-key "C-c C-M-l" 'org-cliplink)))
;; Org cliplink config:1 ends here

;; [[file:~/.emacs.d/init.org::*Org%20bullets][Org bullets:1]]
(use-package org-bullets :ensure t
  :init (add-hook 'org-mode-hook 'org-bullets-mode))
;; Org bullets:1 ends here

;; [[file:~/.emacs.d/init.org::*Org%20babel%20config][Org babel config:1]]
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (shell . t)))
;; Org babel config:1 ends here

;; [[file:~/.emacs.d/init.org::*Org%20gtd][Org gtd:1]]
(after 'org
  (setq org-todo-keywords
        '((sequence "TODO(t!/@)" "HOLD(h@)" "NEXT(n!)" "INPROG(i!)"
                    "WAITING(w@)" "REVIEW(r@)" "|"
                    "DONE(d@)" "CANCELLED(c@)")
          (sequence "|" "PLAN(p!)" "MEETING(m!)")
          (sequence "PROJECT(r!)" "|" "DONE(d@)" "CANCELLED(c@)")))
  (setq org-todo-keyword-faces
        '(("TODO" :foreground "red" :weight bold)
          ("REVIEW" :foreground "orange" :weight bold)
          ("NEXT" :foreground "orange" :weight bold)
          ("INPROG" :foreground "orange" :weight bold)
          ("HOLD" :foreground "orange" :weight bold)
          ("WAITING" :foreground "orange" :weight bold)
          ("DONE" org-done)
          ("CANCELLED" org-done)
          ("PROJECT" :foreground "purple" :weight bold)
          ("PLAN" :foreground "purple" :weight bold)
          ("MEETING" :foreground "blue" :weight bold))))
;; Org gtd:1 ends here
