init.org
*** Dired config
   #+BEGIN_SRC emacs-lisp
     (use-package dired-details :ensure t
       :config (dired-details-install)
       :init
       (use-package dash
         :ensure t
         :config
         ;; Reload dired after making changes
         (put '--each 'lisp-indent-function 1)
         (--each '(dired-do-rename
                   dired-create-directory
                   wdired-abort-changes)
           (eval `(defadvice ,it (after revert-buffer activate)
                    (revert-buffer)))))
       :config
       ;; TODO: define these functions
       ;; (use-package wdired
       ;;   :config
       ;;   (define-key wdired-mode-map
       ;;     (vector 'remap 'beginning-of-line) 'esc/dired-back-to-start-of-files)
       ;;   (define-key wdired-mode-map
       ;;     (vector 'remap 'esc/back-to-indentation-or-beginning)
       ;;     'esc/dired-back-to-start-of-files)
       ;;   (define-key wdired-mode-map
       ;;     (vector 'remap 'beginning-of-buffer) 'esc/dired-back-to-top)
       ;;   (define-key wdired-mode-map
       ;;     (vector 'remap 'end-of-buffer) 'esc/dired-jump-to-bottom))

       (setq diredp-hide-details-initially-flag t)
       (use-package dired-x
         :config
         (setq-default dired-omit-files-p t)
         (setq dired-omit-files
               (concat dired-omit-files "\\|\\.pyc$\\|\\.elc$\\|\\.~undo-tree~\\.gz$\\|\\.projectile$")))

       (after "dired-aux"
         (setq dired-free-space-args "-Ph")
         (setq dired-guess-shell-alist-user '(("\\.mp4$" "cvlc" "mplayer")
                                              ("\\.avi$" "cvlc" "mplayer")
                                              ("\\.mkv$" "cvlc" "mplayer")
                                              ("\\.pdf$" "evince" "zathura")
                                              ("\\.tar.bz2" "dtrx -n --one=here" "tar jxvf")
                                              ("\\.tar.gz" "dtrx -n --one=here" "tar xzvf")
                                              ("\\.rar" "dtrx -n --one=here" "unrar e")
                                              ("\\.zip" "dtrx -n --one=here")
                                              ("\\.*$" "xdg-open")))
         (add-to-list 'dired-compress-file-suffixes '("\\.zip$" "unzip")))
       (setq dired-listing-switches "-Alhv")
       (setq dired-recursive-copies 'always)
       (setq dired-recursive-deletes 'always)
       (after "ibuf-ext"
         (add-to-list 'ibuffer-saved-filter-groups
                      '("default" ("dired" (mode . dired-mode)))))

       ;; TODO: move this somewhere it belongs
       ;; Allow running multiple async commands simultaneously
       (defadvice shell-command (after shell-in-new-buffer
                                  (command &optional output-buffer error-buffer))
         (when (get-buffer "*Async Shell Command*")
           (with-current-buffer "*Async Shell Command*" (rename-uniquely))))
       (ad-activate 'shell-command)

       (after 'evil-leader
         (evil-leader/set-key
           "d" (defun dired-here ()
                 (interactive)
                 (let ((cwd (file-name-directory (or (buffer-file-name) ""))))
                   (cond
                    ((and cwd (file-exists-p cwd))
                     (dired cwd))
                    (t
                     (message "I'm not sure which dir to view.")))))))

       (setq dired-dwim-target t)
       (after "dired"
         (add-hook 'dired-mode-hook 'auto-revert-mode)
         (defun dired-find-parent-directory ()
           (interactive)
           (find-alternate-file ".."))
         (define-key dired-mode-map (kbd "<right>") 'dired-find-file)
         (define-key dired-mode-map (vector 'remap 'evil-forward-char) 'dired-find-file)
         (define-key dired-mode-map (kbd "<left>") 'dired-find-parent-directory)
         (define-key dired-mode-map (vector 'remap 'evil-backward-char) 'dired-find-parent-directory)

         (define-key dired-mode-map (vector 'remap 'beginning-of-buffer)
           (defun dired-back-to-top ()
             (interactive)
             (beginning-of-buffer)
             (unless (search-forward ".." nil 'noerror)
               (beginning-of-buffer))
             (dired-next-line 1)))

         (define-key dired-mode-map (vector 'remap 'end-of-buffer)
           (defun dired-jump-to-bottom ()
             (interactive)
             (end-of-buffer)
             (dired-next-line -1)))))
   #+END_SRC
*** Diminish config
   #+BEGIN_SRC emacs-lisp :tangle no
  (use-package diminish
    :config
    (after 'undo-tree-autoloads
      (global-undo-tree-mode t)
      (setq undo-tree-visualizer-timestamps t
            undo-tree-visualizer-relative-timestamps t))

    ;; less clutter on the mode line
    (diminish 'auto-revert-mode)
    (after 'test-mode (diminish 'test-mode))
    (diminish 'auto-fill-function)
    ;; (diminish 'visual-line-mode)
    ;; (diminish 'global-visual-line-mode)
    (after 'autopair  (diminish 'autopair-mode))
    (after 'abbrev    (diminish 'abbrev-mode))
    (after 'org-indent (diminish 'org-indent-mode))
    (after 'magit (diminish 'magit-auto-revert-mode))
    (after 'eldoc (diminish 'eldoc-mode))
    (after 'smerge-mode (diminish 'smerge-mode))
    ;; (after 'auto-complete (diminish 'auto-complete-mode))
    (after 'esc-mode (diminish 'esc-mode)))
   #+END_SRC
*** Minibuffer config
#+BEGIN_SRC emacs-lisp
  (add-hook 'eval-expression-minibuffer-setup-hook 'eldoc-mode)
#+END_SRC
*** TIme clocking config...
#+BEGIN_SRC emacs-lisp
  (setq org-clock-persist 'history)
  (org-clock-persistence-insinuate)
#+END_SRC
*** Mouse avoidance config
#+BEGIN_SRC emacs-lisp
  (mouse-avoidance-mode 'exile)
#+END_SRC

** Keybindings
#+BEGIN_SRC emacs-lisp
(bind-key "M-;" 'comment-or-uncomment-region)
#+END_SRC

** Language configs
*** Programming modes config
#+BEGIN_SRC emacs-lisp
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
  (add-hook 'prog-mode-hook 'electric-pair-local-mode)
#+END_SRC
**** Aggressive indent config
#+BEGIN_SRC emacs-lisp
  (use-package aggressive-indent :ensure t
    :config
    (defun turn-off-aggressive-indent-mode ()
      (interactive)
      (aggressive-indent-mode -1))
    (remove-hook 'markdown-mode-hook 'turn-off-aggressive-indent-mode))
#+END_SRC
**** Rainbow-mode
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode :ensure t
    :config
    (defun turn-on-rainbow-mode()
      "Turn on `rainbow-mode`."
      (interactive)
      (rainbow-mode 1))
    (defun turn-off-rainbow-mode()
      "Turn off `rainbow-mode`."
      (interactive)
      (rainbow-mode -1))
    (add-hook 'prog-mode-hook 'turn-on-rainbow-mode)
    ;; otherwise the first half of `#define` gets highlighted
    (add-hook 'c-mode-common-hook 'turn-off-rainbow-mode))
#+END_SRC
**** FIC-mode config
#+BEGIN_SRC emacs-lisp
  (use-package fic-mode :ensure t
    :diminish (fic-mode . "")
    :config
    (push "DISCUSS" fic-highlighted-words)
    (push "RESUME" fic-highlighted-words)
    (defun turn-off-fic-mode ()
       "Turn fic-mode off."
       (interactive)
       (fic-mode -1))
    (defun turn-on-fic-mode ()
       "Turn fic-mode on."
       (interactive)
       (fic-mode 1))
    (add-hook 'conf-mode-hook 'turn-on-fic-mode)
    (add-hook 'yaml-mode-hook 'turn-on-fic-mode)
    ;; TODO: prove that this works?
    (add-hook 'markdown-mode-hook 'turn-on-fic-mode)
    (add-hook 'prog-mode-hook 'turn-on-fic-mode))
#+END_SRC
*** C modes config
**** Rtags config
#+BEGIN_SRC emacs-lisp
  (use-package rtags :ensure t
    :bind ("C-;" . rtags-find-symbol-at-point))
#+END_SRC
**** Qt config
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.pro\\'" . conf-mode))
  (add-to-list 'auto-mode-alist '("\\.pri\\'" . conf-mode))
#+END_SRC
**** S-refactor config
#+BEGIN_SRC emacs-lisp
  (use-package srefactor :ensure t
    :config
    (semantic-mode 1)
    (after 'evil-leader
      (evil-leader/set-key-for-mode 'c++-mode
        "rh" 'srefactor-refactor-at-point)))
#+END_SRC

*** Javascript config
**** json-mode
#+BEGIN_SRC emacs-lisp
  (use-package json-mode :ensure t)
#+END_SRC
*** Typescript config
#+BEGIN_SRC emacs-lisp
  (use-package typescript-mode
    :ensure t
    :pin melpa-stable)

  (use-package tide
    :ensure t
    :pin melpa-stable
    :after (typescript-mode)
    :config (add-hook 'typescript-mode-hook 'tide/configure-tide))

  (defun tide/configure-tide ()
    (tide-setup)
    (flycheck-mode 1)
    (setq flycheck-check-syntax-automatically '(save mode-enabled))
    (company-mode-on)
    (eldoc-mode 1)
    (tide-hl-identifier-node t)
    (company-mode 1)
    (setq company-backends '(company-tide company-yasnippet))
    (bind-key "TAB" 'yas-expand yas-minor-mode-map))

  ;; aligns annotation to the right hand side
  ;; (setq company-tooltip-align-annotations t)

  ;; formats the buffer before saving
  ;; (add-hook 'before-save-hook 'tide-format-before-save)
#+END_SRC
