init.el

;; [[file:~/.emacs.d/init.org::*Dired%20config][Dired config:1]]
(use-package dired-details :ensure t
  :config (dired-details-install)
  :init
  (use-package dash
    :ensure t
    :config
    ;; Reload dired after making changes
    (put '--each 'lisp-indent-function 1)
    (--each '(dired-do-rename
              dired-create-directory
              wdired-abort-changes)
      (eval `(defadvice ,it (after revert-buffer activate)
               (revert-buffer)))))
  :config
  ;; TODO: define these functions
  ;; (use-package wdired
  ;;   :config
  ;;   (define-key wdired-mode-map
  ;;     (vector 'remap 'beginning-of-line) 'esc/dired-back-to-start-of-files)
  ;;   (define-key wdired-mode-map
  ;;     (vector 'remap 'esc/back-to-indentation-or-beginning)
  ;;     'esc/dired-back-to-start-of-files)
  ;;   (define-key wdired-mode-map
  ;;     (vector 'remap 'beginning-of-buffer) 'esc/dired-back-to-top)
  ;;   (define-key wdired-mode-map
  ;;     (vector 'remap 'end-of-buffer) 'esc/dired-jump-to-bottom))

  (setq diredp-hide-details-initially-flag t)
  (use-package dired-x
    :config
    (setq-default dired-omit-files-p t)
    (setq dired-omit-files
          (concat dired-omit-files "\\|\\.pyc$\\|\\.elc$\\|\\.~undo-tree~\\.gz$\\|\\.projectile$")))

  (after "dired-aux"
    (setq dired-free-space-args "-Ph")
    (setq dired-guess-shell-alist-user '(("\\.mp4$" "cvlc" "mplayer")
                                         ("\\.avi$" "cvlc" "mplayer")
                                         ("\\.mkv$" "cvlc" "mplayer")
                                         ("\\.pdf$" "evince" "zathura")
                                         ("\\.tar.bz2" "dtrx -n --one=here" "tar jxvf")
                                         ("\\.tar.gz" "dtrx -n --one=here" "tar xzvf")
                                         ("\\.rar" "dtrx -n --one=here" "unrar e")
                                         ("\\.zip" "dtrx -n --one=here")
                                         ("\\.*$" "xdg-open")))
    (add-to-list 'dired-compress-file-suffixes '("\\.zip$" "unzip")))
  (setq dired-listing-switches "-Alhv")
  (setq dired-recursive-copies 'always)
  (setq dired-recursive-deletes 'always)
  (after "ibuf-ext"
    (add-to-list 'ibuffer-saved-filter-groups
                 '("default" ("dired" (mode . dired-mode)))))

  ;; TODO: move this somewhere it belongs
  ;; Allow running multiple async commands simultaneously
  (defadvice shell-command (after shell-in-new-buffer
                             (command &optional output-buffer error-buffer))
    (when (get-buffer "*Async Shell Command*")
      (with-current-buffer "*Async Shell Command*" (rename-uniquely))))
  (ad-activate 'shell-command)

  (after 'evil-leader
    (evil-leader/set-key
      "d" (defun dired-here ()
            (interactive)
            (let ((cwd (file-name-directory (or (buffer-file-name) ""))))
              (cond
               ((and cwd (file-exists-p cwd))
                (dired cwd))
               (t
                (message "I'm not sure which dir to view.")))))))

  (setq dired-dwim-target t)
  (after "dired"
    (add-hook 'dired-mode-hook 'auto-revert-mode)
    (defun dired-find-parent-directory ()
      (interactive)
      (find-alternate-file ".."))
    (define-key dired-mode-map (kbd "<right>") 'dired-find-file)
    (define-key dired-mode-map (vector 'remap 'evil-forward-char) 'dired-find-file)
    (define-key dired-mode-map (kbd "<left>") 'dired-find-parent-directory)
    (define-key dired-mode-map (vector 'remap 'evil-backward-char) 'dired-find-parent-directory)

    (define-key dired-mode-map (vector 'remap 'beginning-of-buffer)
      (defun dired-back-to-top ()
        (interactive)
        (beginning-of-buffer)
        (unless (search-forward ".." nil 'noerror)
          (beginning-of-buffer))
        (dired-next-line 1)))

    (define-key dired-mode-map (vector 'remap 'end-of-buffer)
      (defun dired-jump-to-bottom ()
        (interactive)
        (end-of-buffer)
        (dired-next-line -1)))))
;; Dired config:1 ends here

;; [[file:~/.emacs.d/init.org::*Minibuffer%20config][Minibuffer config:1]]
(add-hook 'eval-expression-minibuffer-setup-hook 'eldoc-mode)
;; Minibuffer config:1 ends here

;; [[file:~/.emacs.d/init.org::*TIme%20clocking%20config...][TIme clocking config...:1]]
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)
;; TIme clocking config...:1 ends here

;; [[file:~/.emacs.d/init.org::*Mouse%20avoidance%20config][Mouse avoidance config:1]]
(mouse-avoidance-mode 'exile)
;; Mouse avoidance config:1 ends here

;; [[file:~/.emacs.d/init.org::*Programming%20modes%20config][Programming modes config:1]]
(add-hook 'before-save-hook 'delete-trailing-whitespace)
(add-hook 'prog-mode-hook 'electric-pair-local-mode)
;; Programming modes config:1 ends here

;; [[file:~/.emacs.d/init.org::*Aggressive%20indent%20config][Aggressive indent config:1]]
(use-package aggressive-indent :ensure t
  :config
  (defun turn-off-aggressive-indent-mode ()
    (interactive)
    (aggressive-indent-mode -1))
  (remove-hook 'markdown-mode-hook 'turn-off-aggressive-indent-mode))
;; Aggressive indent config:1 ends here

;; [[file:~/.emacs.d/init.org::*Rainbow-mode][Rainbow-mode:1]]
(use-package rainbow-mode :ensure t
  :config
  (defun turn-on-rainbow-mode()
    "Turn on `rainbow-mode`."
    (interactive)
    (rainbow-mode 1))
  (defun turn-off-rainbow-mode()
    "Turn off `rainbow-mode`."
    (interactive)
    (rainbow-mode -1))
  (add-hook 'prog-mode-hook 'turn-on-rainbow-mode)
  ;; otherwise the first half of `#define` gets highlighted
  (add-hook 'c-mode-common-hook 'turn-off-rainbow-mode))
;; Rainbow-mode:1 ends here

;; [[file:~/.emacs.d/init.org::*FIC-mode%20config][FIC-mode config:1]]
(use-package fic-mode :ensure t
  :diminish (fic-mode . "")
  :config
  (push "DISCUSS" fic-highlighted-words)
  (push "RESUME" fic-highlighted-words)
  (defun turn-off-fic-mode ()
     "Turn fic-mode off."
     (interactive)
     (fic-mode -1))
  (defun turn-on-fic-mode ()
     "Turn fic-mode on."
     (interactive)
     (fic-mode 1))
  (add-hook 'conf-mode-hook 'turn-on-fic-mode)
  (add-hook 'yaml-mode-hook 'turn-on-fic-mode)
  ;; TODO: prove that this works?
  (add-hook 'markdown-mode-hook 'turn-on-fic-mode)
  (add-hook 'prog-mode-hook 'turn-on-fic-mode))
;; FIC-mode config:1 ends here

;; [[file:~/.emacs.d/init.org::*Rtags%20config][Rtags config:1]]
(use-package rtags :ensure t
  :bind ("C-;" . rtags-find-symbol-at-point))
;; Rtags config:1 ends here

;; [[file:~/.emacs.d/init.org::*Qt%20config][Qt config:1]]
(add-to-list 'auto-mode-alist '("\\.pro\\'" . conf-mode))
(add-to-list 'auto-mode-alist '("\\.pri\\'" . conf-mode))
;; Qt config:1 ends here

;; [[file:~/.emacs.d/init.org::*S-refactor%20config][S-refactor config:1]]
(use-package srefactor :ensure t
  :config
  (semantic-mode 1)
  (after 'evil-leader
    (evil-leader/set-key-for-mode 'c++-mode
      "rh" 'srefactor-refactor-at-point)))
;; S-refactor config:1 ends here
