init.org
*** Company mode
#+BEGIN_SRC emacs-lisp
(use-package company :ensure t
  :defer t
  :init (global-company-mode))
#+END_SRC
*** Python config
#+BEGIN_SRC emacs-lisp
  (setq python-indent 4
        python-enable-yapf-format-on-save nil)
#+END_SRC
**** anaconda mode
#+BEGIN_SRC emacs-lisp
  (use-package anaconda-mode :ensure t
    :defer t
    :init
    (progn
      (setq anaconda-mode-installation-directory
            (expand-file-name "anaconda-mode" esc-meta-directory))
      (add-hook 'python-mode-hook 'anaconda-mode))
    :config
    (progn
      ;; (spacemacs/set-leader-keys-for-major-mode 'python-mode
      ;;                                           "hh" 'anaconda-mode-show-doc
      ;;                                           "gg" 'anaconda-mode-find-definitions
      ;;                                           "ga" 'anaconda-mode-find-assignments
      ;;                                           "gu" 'anaconda-mode-find-references)
      ;; (evilified-state-evilify anaconda-mode-view-mode anaconda-mode-view-mode-map
      ;;                          (kbd "q") 'quit-window)
      ;; (spacemacs|hide-lighter anaconda-mode)

      (defadvice anaconda-mode-goto (before python/anaconda-mode-goto activate)
        (evil--jumps-push))))
#+END_SRC
**** company-anaconda
#+BEGIN_SRC emacs-lisp
  (use-package company-anaconda :ensure t
    :defer t
    :init
    (add-to-list 'company-backends 'company-anaconda))
#+END_SRC
**** yapf
#+BEGIN_SRC emacs-lisp
  (use-package py-yapf :ensure t
    ;; FIXME: have something this cool
    ;; :init
    ;; (spacemacs/set-leader-keys-for-major-mode 'python-mode "=" 'py-yapf-buffer)
    :config
    (when python-enable-yapf-format-on-save
      (add-hook 'python-mode-hook 'py-yapf-enable-on-save)))
#+END_SRC
*** Coffeescript config
#+BEGIN_SRC emacs-lisp
  (use-package coffee-mode :ensure t)
#+END_SRC
*** C mode config
TODO: determine when/where these are defined
#+BEGIN_SRC emacs-lisp
  (defun esc-customize-cc-search-directories ()
    (add-to-list 'cc-search-directories '"../inc")
    (add-to-list 'cc-search-directories '"../src"))
  (add-hook 'cc-mode-hook 'esc-customize-cc-search-directories)

  (setq-default ff-always-in-other-window t)
#+END_SRC
**** Irony config
#+BEGIN_SRC emacs-lisp
  (use-package irony :ensure t
    :config
    (add-hook 'c++-mode-hook 'irony-mode)
    (add-hook 'c-mode-hook 'irony-mode)

    (defun my-irony-mode-hook ()
      (define-key irony-mode-map
        [remap completion-at-point] 'counsel-irony)
      (define-key irony-mode-map
        [remap complete-symbol] 'counsel-irony))
    (add-hook 'irony-mode-hook 'my-irony-mode-hook)
    (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options))
#+END_SRC
*** Shell config

There's no reason to query you about your favorite shell with every
new terminal.
#+BEGIN_SRC emacs-lisp
  (setq explicit-shell-file-name
        (if (file-exists-p "/usr/bin/zsh")
            "/usr/bin/zsh"
          "/bin/bash"))
#+END_SRC

Destroy term buffers when the process is exited.
#+BEGIN_SRC emacs-lisp
  (defadvice term-handle-exit
      (after term-kill-buffer-on-exit activate)
    (kill-buffer))
#+END_SRC

Mark scripts executable on save.
#+BEGIN_SRC emacs-lisp
  (add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)
#+END_SRC

*** Markdown config
#+BEGIN_SRC emacs-lisp
  (use-package markdown-mode :ensure t)
#+END_SRC
*** Lua mode config
#+BEGIN_SRC emacs-lisp
  (use-package lua-mode :ensure t)
#+END_SRC
*** Magithub config
#+BEGIN_SRC emacs-lisp
  (use-package magithub :ensure t
    :after magit
    :config (magithub-feature-autoinject t))
#+END_SRC
*** Yasnippet config
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet :ensure t
    :load-path "~/.emacs.d/plugins/yasnippet"
    :config
    (yas-reload-all)
    (yas-global-mode 1))
#+END_SRC
*** RestructuredText config
   #+BEGIN_SRC emacs-lisp
     (use-package rst :ensure t
       :config (add-hook 'rst-mode-hook 'auto-fill-mode))
   #+END_SRC
*** Yaml mode
#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode
    :ensure t
    :mode (("\\.yml$" . yaml-mode)))
#+END_SRC
*** Bitbake config
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.bb\\'" . conf-mode))
  (add-to-list 'auto-mode-alist '("\\.bbappend\\'" . conf-mode))
#+END_SRC
*** Docker config
#+BEGIN_SRC emacs-lisp
  (use-package dockerfile-mode :ensure t)
  (add-to-list 'auto-mode-alist '("\\.env\\'" . conf-mode))
#+END_SRC
*** Qml mode config
#+BEGIN_SRC emacs-lisp
  (use-package qml-mode :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.qml$" . qml-mode)))

  (use-package company-qml :ensure t
    :config (add-to-list 'company-backends 'company-qml))
#+END_SRC
*** Prose
**** Writegood mode config
#+BEGIN_SRC emacs-lisp
   (use-package writegood-mode :ensure t)
#+END_SRC

** Extra
*** wakatime config
#+BEGIN_SRC emacs-lisp
  (use-package wakatime-mode
    :ensure t
    :config
    (global-wakatime-mode t))
#+END_SRC
*** zygospore config
#+BEGIN_SRC emacs-lisp
  (use-package zygospore
    :ensure t
    :pin melpa-stable
    :bind ("C-x 1" . zygospore-toggle-delete-other-windows))
#+END_SRC
*** Ivy
#+BEGIN_SRC emacs-lisp
   (use-package ivy :ensure t
     :diminish (ivy-mode . "")
     :init
     (use-package avy :ensure t)
     (use-package counsel :ensure t)
     :bind
     (:map ivy-minibuffer-map
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           ("M-i" . imenu))
     :config
     (ivy-mode 1)
     ;; add ‘recentf-mode’ and bookmarks to ‘ivy-switch-buffer’.
     (setq ivy-use-virtual-buffers t)
     ;; ignore undo-tree files when switching buffers
     (add-to-list 'ivy-ignore-buffers "\\.~undo-tree~\\.gz")
     ;; number of result lines to display
     (setq ivy-height 10)
     ;; does not count candidates
     (setq ivy-count-format "")
     ;; no regexp by default
     (setq ivy-initial-inputs-alist nil)
     ;; configure regexp engine.
     (setq ivy-re-builders-alist
           ;; allow input not in order
           '((t   . ivy--regex-ignore-order))))
#+END_SRC
;; TODO: sort this incipient work into org home
*** Which-key mode
#+BEGIN_SRC emacs-lisp
  (use-package which-key :ensure t
    :diminish (which-key-mode . "")
    :init
    (which-key-setup-side-window-right-bottom)
    :config
    (which-key-mode 1))
#+END_SRC

*** Git config
**** Git time machine config
#+BEGIN_SRC emacs-lisp
  (use-package git-timemachine :ensure t
    :config
    ;; http://blog.binchen.org/posts/use-git-timemachine-with-evil.html
    (add-hook 'git-timemachine-mode-hook #'evil-normalize-keymaps))
#+END_SRC
**** Git gutter config
#+BEGIN_SRC emacs-lisp
  (use-package git-gutter+ :ensure t
    :config
    (global-git-gutter+-mode))
#+END_SRC
**** Magit config
   #+BEGIN_SRC emacs-lisp
     (use-package magit
       :ensure t
       :commands magit-status
       :bind ("C-c C-s" . 'magit-status))
   #+END_SRC
   
**** Git messenger config
   #+BEGIN_SRC emacs-lisp
  (use-package git-messenger :ensure t
        )
   #+END_SRC
   
**** Git modes
#+BEGIN_SRC emacs-lisp
  (use-package gitignore-mode :ensure t)
  (use-package gitconfig-mode :ensure t)
#+END_SRC
*** WIndow rotation
#+BEGIN_SRC emacs-lisp
  (use-package rotate :ensure t)
#+END_SRC
