init.el

;; [[file:~/.emacs.d/init.org::*Company%20mode][Company mode:1]]
(use-package company :ensure t
  :defer t
  :init (global-company-mode))
;; Company mode:1 ends here

;; [[file:~/.emacs.d/init.org::*Python%20config][Python config:1]]
(setq python-indent 4
      python-enable-yapf-format-on-save nil)
;; Python config:1 ends here

;; [[file:~/.emacs.d/init.org::*anaconda%20mode][anaconda mode:1]]
(use-package anaconda-mode :ensure t
  :defer t
  :init
  (progn
    (setq anaconda-mode-installation-directory
          (expand-file-name "anaconda-mode" esc-meta-directory))
    (add-hook 'python-mode-hook 'anaconda-mode))
  :config
  (progn
    ;; (spacemacs/set-leader-keys-for-major-mode 'python-mode
    ;;                                           "hh" 'anaconda-mode-show-doc
    ;;                                           "gg" 'anaconda-mode-find-definitions
    ;;                                           "ga" 'anaconda-mode-find-assignments
    ;;                                           "gu" 'anaconda-mode-find-references)
    ;; (evilified-state-evilify anaconda-mode-view-mode anaconda-mode-view-mode-map
    ;;                          (kbd "q") 'quit-window)
    ;; (spacemacs|hide-lighter anaconda-mode)

    (defadvice anaconda-mode-goto (before python/anaconda-mode-goto activate)
      (evil--jumps-push))))
;; anaconda mode:1 ends here

;; [[file:~/.emacs.d/init.org::*company-anaconda][company-anaconda:1]]
(use-package company-anaconda :ensure t
  :defer t
  :init
  (add-to-list 'company-backends 'company-anaconda))
;; company-anaconda:1 ends here

;; [[file:~/.emacs.d/init.org::*yapf][yapf:1]]
(use-package py-yapf :ensure t
  ;; FIXME: have something this cool
  ;; :init
  ;; (spacemacs/set-leader-keys-for-major-mode 'python-mode "=" 'py-yapf-buffer)
  :config
  (when python-enable-yapf-format-on-save
    (add-hook 'python-mode-hook 'py-yapf-enable-on-save)))
;; yapf:1 ends here

;; [[file:~/.emacs.d/init.org::*Coffeescript%20config][Coffeescript config:1]]
(use-package coffee-mode :ensure t)
;; Coffeescript config:1 ends here

;; [[file:~/.emacs.d/init.org::*C%20mode%20config][C mode config:1]]
(defun esc-customize-cc-search-directories ()
  (add-to-list 'cc-search-directories '"../inc")
  (add-to-list 'cc-search-directories '"../src"))
(add-hook 'cc-mode-hook 'esc-customize-cc-search-directories)

(setq-default ff-always-in-other-window t)
;; C mode config:1 ends here

;; [[file:~/.emacs.d/init.org::*Irony%20config][Irony config:1]]
(use-package irony :ensure t
  :config
  (add-hook 'c++-mode-hook 'irony-mode)
  (add-hook 'c-mode-hook 'irony-mode)

  (defun my-irony-mode-hook ()
    (define-key irony-mode-map
      [remap completion-at-point] 'counsel-irony)
    (define-key irony-mode-map
      [remap complete-symbol] 'counsel-irony))
  (add-hook 'irony-mode-hook 'my-irony-mode-hook)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options))
;; Irony config:1 ends here

;; [[file:~/.emacs.d/init.org::*Shell%20config][Shell config:1]]
(setq explicit-shell-file-name
      (if (file-exists-p "/usr/bin/zsh")
          "/usr/bin/zsh"
        "/bin/bash"))
;; Shell config:1 ends here

;; [[file:~/.emacs.d/init.org::*Shell%20config][Shell config:2]]
(defadvice term-handle-exit
    (after term-kill-buffer-on-exit activate)
  (kill-buffer))
;; Shell config:2 ends here

;; [[file:~/.emacs.d/init.org::*Shell%20config][Shell config:3]]
(add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)
;; Shell config:3 ends here

;; [[file:~/.emacs.d/init.org::*Markdown%20config][Markdown config:1]]
(use-package markdown-mode :ensure t)
;; Markdown config:1 ends here

;; [[file:~/.emacs.d/init.org::*Lua%20mode%20config][Lua mode config:1]]
(use-package lua-mode :ensure t)
;; Lua mode config:1 ends here

;; [[file:~/.emacs.d/init.org::*Magithub%20config][Magithub config:1]]
(use-package magithub :ensure t
  :after magit
  :config (magithub-feature-autoinject t))
;; Magithub config:1 ends here

;; [[file:~/.emacs.d/init.org::*Yasnippet%20config][Yasnippet config:1]]
(use-package yasnippet :ensure t
  :load-path "~/.emacs.d/plugins/yasnippet"
  :config
  (yas-reload-all)
  (yas-global-mode 1))
;; Yasnippet config:1 ends here

;; [[file:~/.emacs.d/init.org::*RestructuredText%20config][RestructuredText config:1]]
(use-package rst :ensure t
  :config (add-hook 'rst-mode-hook 'auto-fill-mode))
;; RestructuredText config:1 ends here

;; [[file:~/.emacs.d/init.org::*Yaml%20mode][Yaml mode:1]]
(use-package yaml-mode
  :ensure t
  :mode (("\\.yml$" . yaml-mode)))
;; Yaml mode:1 ends here

;; [[file:~/.emacs.d/init.org::*Bitbake%20config][Bitbake config:1]]
(add-to-list 'auto-mode-alist '("\\.bb\\'" . conf-mode))
(add-to-list 'auto-mode-alist '("\\.bbappend\\'" . conf-mode))
;; Bitbake config:1 ends here

;; [[file:~/.emacs.d/init.org::*Docker%20config][Docker config:1]]
(use-package dockerfile-mode :ensure t)
(add-to-list 'auto-mode-alist '("\\.env\\'" . conf-mode))
;; Docker config:1 ends here

;; [[file:~/.emacs.d/init.org::*Qml%20mode%20config][Qml mode config:1]]
(use-package qml-mode :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.qml$" . qml-mode)))

(use-package company-qml :ensure t
  :config (add-to-list 'company-backends 'company-qml))
;; Qml mode config:1 ends here

;; [[file:~/.emacs.d/init.org::*Writegood%20mode%20config][Writegood mode config:1]]
(use-package writegood-mode :ensure t)
;; Writegood mode config:1 ends here

;; [[file:~/.emacs.d/init.org::*Ivy][Ivy:1]]
(use-package ivy :ensure t
  :diminish (ivy-mode . "")
  :init
  (use-package avy :ensure t)
  (use-package counsel :ensure t)
  :bind
  (:map ivy-minibuffer-map
        ("C-j" . ivy-next-line)
        ("C-k" . ivy-previous-line)
        ("M-i" . imenu))
  :config
  (ivy-mode 1)
  ;; add ‘recentf-mode’ and bookmarks to ‘ivy-switch-buffer’.
  (setq ivy-use-virtual-buffers t)
  ;; ignore undo-tree files when switching buffers
  (add-to-list 'ivy-ignore-buffers "\\.~undo-tree~\\.gz")
  ;; number of result lines to display
  (setq ivy-height 10)
  ;; does not count candidates
  (setq ivy-count-format "")
  ;; no regexp by default
  (setq ivy-initial-inputs-alist nil)
  ;; configure regexp engine.
  (setq ivy-re-builders-alist
        ;; allow input not in order
        '((t   . ivy--regex-ignore-order))))
;; Ivy:1 ends here

;; [[file:~/.emacs.d/init.org::*Which-key%20mode][Which-key mode:1]]
(use-package which-key :ensure t
  :diminish (which-key-mode . "")
  :init
  (which-key-setup-side-window-right-bottom)
  :config
  (which-key-mode 1))
;; Which-key mode:1 ends here

;; [[file:~/.emacs.d/init.org::*Git%20time%20machine%20config][Git time machine config:1]]
(use-package git-timemachine :ensure t
  :config
  ;; http://blog.binchen.org/posts/use-git-timemachine-with-evil.html
  (add-hook 'git-timemachine-mode-hook #'evil-normalize-keymaps))
;; Git time machine config:1 ends here

;; [[file:~/.emacs.d/init.org::*Git%20gutter%20config][Git gutter config:1]]
(use-package git-gutter+ :ensure t
  :config
  (global-git-gutter+-mode))
;; Git gutter config:1 ends here

;; [[file:~/.emacs.d/init.org::*Magit%20config][Magit config:1]]
(use-package magit :ensure t
  :commands magit-status)
;; Magit config:1 ends here

;; [[file:~/.emacs.d/init.org::*Git%20messenger%20config][Git messenger config:1]]
(use-package git-messenger :ensure t
      )
;; Git messenger config:1 ends here

;; [[file:~/.emacs.d/init.org::*Git%20modes][Git modes:1]]
(use-package gitignore-mode :ensure t)
(use-package gitconfig-mode :ensure t)
;; Git modes:1 ends here

;; [[file:~/.emacs.d/init.org::*WIndow%20rotation][WIndow rotation:1]]
(use-package rotate :ensure t)
;; WIndow rotation:1 ends here
