init.org
*** Winner config
    #+BEGIN_SRC emacs-lisp
  (use-package winner
    :init
    (progn
      (winner-mode t)
      (setq esc/winner-boring-buffers '("*Completions*"
                                        "*Compile-Log*"
                                        "*inferior-lisp*"
                                        "*Fuzzy Completions*"
                                        "*Apropos*"
                                        "*Help*"
                                        "*cvs*"
                                        "*Buffer List*"
                                        "*Ibuffer*"
                                        "*esh command on file*"))
      (setq winner-boring-buffers
            (append winner-boring-buffers esc/winner-boring-buffers))
      (winner-mode t)))
    #+END_SRC
*** Projectile config
   #+BEGIN_SRC emacs-lisp
     (use-package counsel-projectile :ensure t
       :config (counsel-projectile-mode)
)
   #+END_SRC
*** Flycheck config
#+BEGIN_SRC emacs-lisp
(use-package flycheck :ensure t
  :init (global-flycheck-mode))
#+END_SRC
*** Flyspell config
#+BEGIN_SRC emacs-lisp
  (add-hook 'prog-mode-hook 'flyspell-prog-mode)
#+END_SRC
*** Window manipulation
**** Zoom frame config
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package zoom-frm :ensure t
    ;; TODO: include core-micro-state.el from
    ;; https://github.com/syl20bnr/spacemacs/blob/master/core/core-micro-state.el

    ;; perhaps make the above into a standalone package
    ;; then bind zoom commands with a microstate
    )
#+END_SRC
**** Windmove config
#+BEGIN_SRC emacs-lisp
 ;; Windmove from shift keys
 (use-package windmove
   :ensure t
   :config
   (windmove-default-keybindings)
   (after 'org
     (setq org-replace-disputed-keys t)
     (add-hook 'org-shiftup-final-hook 'windmove-up)
     (add-hook 'org-shiftleft-final-hook 'windmove-left)
     (add-hook 'org-shiftdown-final-hook 'windmove-down)
     (add-hook 'org-shiftright-final-hook 'windmove-right)))
#+END_SRC

*** Rainbow delimeters mode config
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :config (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
#+END_SRC
   
*** Beacon config
#+BEGIN_SRC emacs-lisp
  (use-package beacon
    :ensure t
    :demand t
    :diminish beacon-mode
    :config
    (beacon-mode 1))
#+END_SRC

*** Compilation buffer config
#+BEGIN_SRC emacs-lisp
  (add-to-list 'same-window-buffer-names "*compilation*")
#+END_SRC
**** Bury successful compilation buffer
#+BEGIN_SRC emacs-lisp
  (use-package bury-successful-compilation :ensure t
    :bind ("C-c C-m" . recompile)
    :config (bury-successful-compilation 1))
#+END_SRC

*** Define word
More thanks to [[https://github.com/abo-abo][abo-abo]].
#+BEGIN_SRC emacs-lisp
  (use-package define-word :ensure t
    :bind ("C-h d"  . define-word-at-point))
#+END_SRC

*** Lexbind config
#+BEGIN_SRC emacs-lisp
  (use-package lexbind-mode
    :ensure t
    :init (add-hook 'emacs-lisp-mode-hook 'lexbind-mode))
#+END_SRC

*** Goto last change config
#+BEGIN_SRC emacs-lisp
  (use-package goto-chg :ensure t)
#+END_SRC
*** Misc cmds config
#+BEGIN_SRC emacs-lisp
  (use-package misc
    :commands zap-up-to-char
    :init ; seeing as I don't use these commands terribly often
    (after 'esc-mode
      (esc-key "M-z"     'zap-up-to-char) ; up-to, life saver
      (esc-key "M-Z"     'zap-to-char)))

  (use-package misc-cmds
    :commands revert-buffer-no-confirm
    :init ; takes a while to need the get-out-of-jail-free button
    (after 'esc-mode
      (esc-key "C-x M-r" 'revert-buffer-no-confirm)))
#+END_SRC
*** Browse kill ring config
#+BEGIN_SRC emacs-lisp
  (use-package browse-kill-ring
    :ensure t
    :config
    (setq kill-ring-max 80)
    (browse-kill-ring-default-keybindings))
#+END_SRC
*** Keyfreq mode config
#+BEGIN_SRC emacs-lisp
  (use-package keyfreq
    :ensure t
    :config (keyfreq-autosave-mode 1)
    (setq keyfreq-file
          (expand-file-name "keyfreq" esc-meta-directory)))
#+END_SRC
*** Ztree
#+BEGIN_SRC emacs-lisp
   (use-package ztree :ensure t
     :init
     (setq ztree-dir-move-focus t))
#+END_SRC
*** Dumb jump config
#+BEGIN_SRC emacs-lisp
  (use-package dumb-jump :ensure t
    :bind ("C-'" . dumb-jump-go)
    :config
    (dumb-jump-mode))
#+END_SRC
*** Expand region config
[[http://spw.sdf.org/blog/tech/emacs/expandregionlines.html][Notes from the Library : /blog/tech/emacs/expandregionlines.html]]
#+BEGIN_SRC emacs-lisp
  (use-package expand-region :ensure t
    :bind ("C-=" . er/expand-region)
    :config
    (defadvice er/expand-region (around fill-out-region activate)
      (if (or (not (region-active-p))
              (eq last-command 'er/expand-region))
          ad-do-it
        (if (< (point) (mark))
            (let ((beg (point)))
              (goto-char (mark))
              (end-of-line)
              (forward-char 1)
              (push-mark)
              (goto-char beg)
              (beginning-of-line))
          (let ((end (point)))
            (goto-char (mark))
            (beginning-of-line)
            (push-mark)
            (goto-char end)
            (end-of-line)
            (forward-char 1))))))
#+END_SRC
*** Eyebrowse config
#+BEGIN_SRC emacs-lisp
  (use-package eyebrowse :ensure t
    :config (eyebrowse-mode t))
#+END_SRC
*** Clipmon config
#+BEGIN_SRC emacs-lisp
  (use-package clipmon :ensure t
    :init
    (defvar clipmon--autoinsert " clipmon--autoinserted-this"))
#+END_SRC
*** Recentf config
#+BEGIN_SRC emacs-lisp
  (setq recentf-auto-cleanup 'never)
  (use-package recentf
    :ensure t
    :config (setq recentf-max-menu-items 200
                  recentf-max-saved-items 15
                  recentf-save-file (expand-file-name
                                     "recentf" esc-meta-directory)
                  recentf-keep '(file-remote-p file-readable-p)))
#+END_SRC
*** Tea time config
#+BEGIN_SRC emacs-lisp
   (use-package tea-time :ensure t
     :defer t
     :commands tea-time
     :config
     (use-package notifications
       :commands notifications-notify)
     (defun esc/notify-tea-steeped ()
       (notifications-notify :title "Tea time"
                             :body "Rip out that sac, because your tea bag is done"
                             :app-name "Tea Time"
                             :sound-name "alarm-clock-elapsed"))
     (add-hook 'tea-time-notification-hook 'esc/notify-tea-steeped))
#+END_SRC

*** Highlight-numbers mode
#+BEGIN_SRC emacs-lisp
  (use-package highlight-numbers :ensure t
    :config (add-hook 'prog-mode-hook 'highlight-numbers-mode))
#+END_SRC
*** Sudo edit
#+BEGIN_SRC emacs-lisp
  (use-package sudo-edit :ensure t)
#+END_SRC
*** Save session config
**** Saveplace config
#+BEGIN_SRC emacs-lisp
  (use-package saveplace
    :ensure t
    :config
    (setq-default save-place t)
    (setq save-place-file (expand-file-name "places"
                                            esc-meta-directory)))
#+END_SRC
*** Savehist config
Keep a history of =M-x= across sessions.
#+BEGIN_SRC emacs-lisp
  (use-package savehist
    :ensure t
    :config
    (setq savehist-file (concat user-emacs-directory "meta/savehist"))
    (setq savehist-save-minibuffer-history 1)
    (setq savehist-additional-variables
          '(kill-ring
            search-ring
            regexp-search-ring))
    (savehist-mode 1))
#+END_SRC
