init.el

;; [[file:~/.emacs.d/init.org::*Winner%20config][Winner config:1]]
(use-package winner
  :init
  (progn
    (winner-mode t)
    (setq esc/winner-boring-buffers '("*Completions*"
                                      "*Compile-Log*"
                                      "*inferior-lisp*"
                                      "*Fuzzy Completions*"
                                      "*Apropos*"
                                      "*Help*"
                                      "*cvs*"
                                      "*Buffer List*"
                                      "*Ibuffer*"
                                      "*esh command on file*"))
    (setq winner-boring-buffers
          (append winner-boring-buffers esc/winner-boring-buffers))
    (winner-mode t)))
;; Winner config:1 ends here

;; [[file:~/.emacs.d/init.org::*Projectile%20config][Projectile config:1]]
(use-package counsel-projectile :ensure t
       :config (counsel-projectile-mode)
)
;; Projectile config:1 ends here

;; [[file:~/.emacs.d/init.org::*Flycheck%20config][Flycheck config:1]]
(use-package flycheck :ensure t
  :init (global-flycheck-mode))
;; Flycheck config:1 ends here

;; [[file:~/.emacs.d/init.org::*Flyspell%20config][Flyspell config:1]]
(add-hook 'prog-mode-hook 'flyspell-prog-mode)
;; Flyspell config:1 ends here

;; [[file:~/.emacs.d/init.org::*Windmove%20config][Windmove config:1]]
;; Windmove from shift keys
(use-package windmove
  :ensure t
  :config
  (windmove-default-keybindings)
  (after 'org
    (setq org-replace-disputed-keys t)
    (add-hook 'org-shiftup-final-hook 'windmove-up)
    (add-hook 'org-shiftleft-final-hook 'windmove-left)
    (add-hook 'org-shiftdown-final-hook 'windmove-down)
    (add-hook 'org-shiftright-final-hook 'windmove-right)))
;; Windmove config:1 ends here

;; [[file:~/.emacs.d/init.org::*Rainbow%20delimeters%20mode%20config][Rainbow delimeters mode config:1]]
(use-package rainbow-delimiters
  :ensure t
  :config (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
;; Rainbow delimeters mode config:1 ends here

;; [[file:~/.emacs.d/init.org::*Beacon%20config][Beacon config:1]]
(use-package beacon
  :ensure t
  :demand t
  :diminish beacon-mode
  :config
  (beacon-mode 1))
;; Beacon config:1 ends here

;; [[file:~/.emacs.d/init.org::*Compilation%20buffer%20config][Compilation buffer config:1]]
(add-to-list 'same-window-buffer-names "*compilation*")
;; Compilation buffer config:1 ends here

;; [[file:~/.emacs.d/init.org::*Bury%20successful%20compilation%20buffer][Bury successful compilation buffer:1]]
(use-package bury-successful-compilation :ensure t
  :bind ("C-c C-m" . recompile)
  :config (bury-successful-compilation 1))
;; Bury successful compilation buffer:1 ends here

;; [[file:~/.emacs.d/init.org::*Define%20word][Define word:1]]
(use-package define-word :ensure t
  :bind ("C-h d"  . define-word-at-point))
;; Define word:1 ends here

;; [[file:~/.emacs.d/init.org::*Lexbind%20config][Lexbind config:1]]
(use-package lexbind-mode
  :ensure t
  :init (add-hook 'emacs-lisp-mode-hook 'lexbind-mode))
;; Lexbind config:1 ends here

;; [[file:~/.emacs.d/init.org::*Goto%20last%20change%20config][Goto last change config:1]]
(use-package goto-chg :ensure t)
;; Goto last change config:1 ends here

;; [[file:~/.emacs.d/init.org::*Misc%20cmds%20config][Misc cmds config:1]]
(use-package misc
  :commands zap-up-to-char
  :init ; seeing as I don't use these commands terribly often
  (after 'esc-mode
    (esc-key "M-z"     'zap-up-to-char) ; up-to, life saver
    (esc-key "M-Z"     'zap-to-char)))

(use-package misc-cmds
  :commands revert-buffer-no-confirm
  :init ; takes a while to need the get-out-of-jail-free button
  (after 'esc-mode
    (esc-key "C-x M-r" 'revert-buffer-no-confirm)))
;; Misc cmds config:1 ends here

;; [[file:~/.emacs.d/init.org::*Browse%20kill%20ring%20config][Browse kill ring config:1]]
(use-package browse-kill-ring
  :ensure t
  :config
  (setq kill-ring-max 80)
  (browse-kill-ring-default-keybindings))
;; Browse kill ring config:1 ends here

;; [[file:~/.emacs.d/init.org::*Keyfreq%20mode%20config][Keyfreq mode config:1]]
(use-package keyfreq
  :ensure t
  :config (keyfreq-autosave-mode 1)
  (setq keyfreq-file
        (expand-file-name "keyfreq" esc-meta-directory)))
;; Keyfreq mode config:1 ends here

;; [[file:~/.emacs.d/init.org::*Ztree][Ztree:1]]
(use-package ztree :ensure t
  :init
  (setq ztree-dir-move-focus t))
;; Ztree:1 ends here

;; [[file:~/.emacs.d/init.org::*Dumb%20jump%20config][Dumb jump config:1]]
(use-package dumb-jump :ensure t
  :bind ("C-'" . dumb-jump-go)
  :config
  (dumb-jump-mode))
;; Dumb jump config:1 ends here

;; [[file:~/.emacs.d/init.org::*Expand%20region%20config][Expand region config:1]]
(use-package expand-region :ensure t
  ;; :bind ("C-;" . er/expand-region)
  :config
  (defadvice er/expand-region (around fill-out-region activate)
    (if (or (not (region-active-p))
            (eq last-command 'er/expand-region))
        ad-do-it
      (if (< (point) (mark))
          (let ((beg (point)))
            (goto-char (mark))
            (end-of-line)
            (forward-char 1)
            (push-mark)
            (goto-char beg)
            (beginning-of-line))
        (let ((end (point)))
          (goto-char (mark))
          (beginning-of-line)
          (push-mark)
          (goto-char end)
          (end-of-line)
          (forward-char 1))))))
;; Expand region config:1 ends here

;; [[file:~/.emacs.d/init.org::*Eyebrowse%20config][Eyebrowse config:1]]
(use-package eyebrowse :ensure t
  :config (eyebrowse-mode t))
;; Eyebrowse config:1 ends here

;; [[file:~/.emacs.d/init.org::*Clipmon%20config][Clipmon config:1]]
(use-package clipmon :ensure t
  :init
  (defvar clipmon--autoinsert " clipmon--autoinserted-this"))
;; Clipmon config:1 ends here

;; [[file:~/.emacs.d/init.org::*Recentf%20config][Recentf config:1]]
(setq recentf-auto-cleanup 'never)
(use-package recentf
  :ensure t
  :config (setq recentf-max-menu-items 200
                recentf-max-saved-items 15
                recentf-save-file (expand-file-name
                                   "recentf" esc-meta-directory)
                recentf-keep '(file-remote-p file-readable-p)))
;; Recentf config:1 ends here

;; [[file:~/.emacs.d/init.org::*Tea%20time%20config][Tea time config:1]]
(use-package tea-time :ensure t
  :defer t
  :commands tea-time
  :config
  (use-package notifications
    :commands notifications-notify)
  (defun esc/notify-tea-steeped ()
    (notifications-notify :title "Tea time"
                          :body "Rip out that sac, because your tea bag is done"
                          :app-name "Tea Time"
                          :sound-name "alarm-clock-elapsed"))
  (add-hook 'tea-time-notification-hook 'esc/notify-tea-steeped))
;; Tea time config:1 ends here

;; [[file:~/.emacs.d/init.org::*Highlight-numbers%20mode][Highlight-numbers mode:1]]
(use-package highlight-numbers :ensure t
  :config (add-hook 'prog-mode-hook 'highlight-numbers-mode))
;; Highlight-numbers mode:1 ends here

;; [[file:~/.emacs.d/init.org::*Sudo%20edit][Sudo edit:1]]
(use-package sudo-edit :ensure t)
;; Sudo edit:1 ends here

;; [[file:~/.emacs.d/init.org::*Saveplace%20config][Saveplace config:1]]
(use-package saveplace
  :ensure t
  :config
  (setq-default save-place t)
  (setq save-place-file (expand-file-name "places"
                                          esc-meta-directory)))
;; Saveplace config:1 ends here

;; [[file:~/.emacs.d/init.org::*Savehist%20config][Savehist config:1]]
(use-package savehist
  :ensure t
  :config
  (setq savehist-file (concat user-emacs-directory "meta/savehist"))
  (setq savehist-save-minibuffer-history 1)
  (setq savehist-additional-variables
        '(kill-ring
          search-ring
          regexp-search-ring))
  (savehist-mode 1))
;; Savehist config:1 ends here
