init.org
*** Save desktop config
#+BEGIN_SRC emacs-lisp
  (defadvice desktop-save-in-desktop-dir (before ensure-desktop-dir-exists activate)
      "Ensure `desktop-dirname' exists before function
    `desktop-save-in-desktop-dir' attempts to save the desktop
    file."
      (mkdir desktop-dirname t))

  (setq desktop-path '("~/.emacs.d/meta/desktop/") ;local desktop files
        desktop-base-filename "default"
        desktop-load-locked-desktop t     ;never freeze after crash
        backup-by-copying-when-linked t
        backup-by-copying-when-mismatch t)
  (mkdir (car desktop-path) t)            ; ensure desktop-save dir exists
  (desktop-save-mode 1)                   ;use desktop file
#+END_SRC

*** undo-tree config
#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
    :ensure t
    :diminish (undo-tree-mode . "")
    :config
    (setq undo-limit (* 1024 1024))
    (undo-tree-mode 1)
    ;; (setq undo-tree-auto-save-history nil)
    (defadvice undo-tree-make-history-save-file-name
        (after undo-tree activate)
      "Make zipped `undo-tree' files obvious."
      (setq ad-return-value (concat ad-return-value ".gz")))

    ;; Thanks to [[http://whattheemacsd.com/my-misc.el-02.html][Magnar]]
    ;; for the advice.
    (defadvice undo-tree-undo (around keep-region activate)
      (if (use-region-p)
          (let ((m (set-marker (make-marker) (mark)))
                (p (set-marker (make-marker) (point))))
            ad-do-it
            (goto-char p)
            (set-mark m)
            (set-marker p nil)
            (set-marker m nil))
        ad-do-it)))
#+END_SRC

*** Impatient mode
#+BEGIN_SRC emacs-lisp
  (use-package impatient-mode :ensure t
    :defer t
    :config
    (defun markdown-html (buffer)
      (princ (with-current-buffer buffer
               (format "<!DOCTYPE html><html><title>Impatient Markdown</title><xmp theme=\"united\" style=\"display:none;\"> %s  </xmp><script src=\"http://strapdownjs.com/v/0.2/strapdown.js\"></script></html>" (buffer-substring-no-properties (point-min) (point-max))))
             (current-buffer))))
#+END_SRC
TODO: consider how useful it would be to extend this to other markdown
types. pandoc is a possibility, but then you are observing something
other than what will be published.
*** Wakatime mode
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package wakatime-mode :ensure t
    :config (global-wakatime-mode))
#+END_SRC
*** Restart-emacs config
#+BEGIN_SRC emacs-lisp
  (use-package restart-emacs :ensure t)
#+END_SRC

** Fin

Start the server if we made it this far in one piece.
#+BEGIN_SRC emacs-lisp
  (unless (server-running-p) (server-start))
#+END_SRC

Have a great day~
#+BEGIN_SRC emacs-lisp
  (setq Don t    ;allows `eval-buffer' on *scratch*
        Panic t  ;with `initial-scratch-message'
        initial-scratch-message
         (concat (propertize "Don't\nPanic\n"
                     'font-lock-face '(:height 10.0 :inherit variable-pitch))
                 "\n")) ;newline makes inserted text normal-sized
  ;;; .emacs.el ends here
#+END_SRC

Inform the driver that init has completed.
#+BEGIN_SRC emacs-lisp
  (message "All done, %s%s" (user-login-name) ".")
#+END_SRC

* TODOS
- auto-package-update config
- persistent scratch
- advise mc zap-up-to-char
** Features
- [ ] eldoc
- [ ] color theme
- [ ] multiple-cursors
- [ ] ace-jumps
- [ ] wind-move
- [ ] midnight
- [ ] unselectable-buffer
- [ ] dedicated-buffer
- [ ] ibuffer{-vc,}
- [ ] conf-mode
- [ ] latex config
- [ ] flyspell
- [ ] latex
- [ ] uniquify
- [ ] idle-highlight?
- [ ] persistent workspaces
- [ ] help-plus (custom package)
