init.el

;; [[file:~/.emacs.d/init.org::*Save%20desktop%20config][Save desktop config:1]]
(defadvice desktop-save-in-desktop-dir (before ensure-desktop-dir-exists activate)
    "Ensure `desktop-dirname' exists before function
  `desktop-save-in-desktop-dir' attempts to save the desktop
  file."
    (mkdir desktop-dirname t))

(setq desktop-path '("~/.emacs.d/meta/desktop/") ;local desktop files
      desktop-base-filename "default"
      desktop-load-locked-desktop t     ;never freeze after crash
      backup-by-copying-when-linked t
      backup-by-copying-when-mismatch t)
(mkdir (car desktop-path) t)            ; ensure desktop-save dir exists
(desktop-save-mode 1)                   ;use desktop file
;; Save desktop config:1 ends here

;; [[file:~/.emacs.d/init.org::*undo-tree%20config][undo-tree config:1]]
(use-package undo-tree
  :ensure t
  :diminish (undo-tree-mode . "")
  :config
  (setq undo-limit (* 1024 1024))
  (undo-tree-mode 1)
  ;; (setq undo-tree-auto-save-history nil)
  (defadvice undo-tree-make-history-save-file-name
      (after undo-tree activate)
    "Make zipped `undo-tree' files obvious."
    (setq ad-return-value (concat ad-return-value ".gz")))

  ;; Thanks to [[http://whattheemacsd.com/my-misc.el-02.html][Magnar]]
  ;; for the advice.
  (defadvice undo-tree-undo (around keep-region activate)
    (if (use-region-p)
        (let ((m (set-marker (make-marker) (mark)))
              (p (set-marker (make-marker) (point))))
          ad-do-it
          (goto-char p)
          (set-mark m)
          (set-marker p nil)
          (set-marker m nil))
      ad-do-it)))
;; undo-tree config:1 ends here

;; [[file:~/.emacs.d/init.org::*Impatient%20mode][Impatient mode:1]]
(use-package impatient-mode :ensure t
  :defer t
  :config
  (defun markdown-html (buffer)
    (princ (with-current-buffer buffer
             (format "<!DOCTYPE html><html><title>Impatient Markdown</title><xmp theme=\"united\" style=\"display:none;\"> %s  </xmp><script src=\"http://strapdownjs.com/v/0.2/strapdown.js\"></script></html>" (buffer-substring-no-properties (point-min) (point-max))))
           (current-buffer))))
;; Impatient mode:1 ends here

;; [[file:~/.emacs.d/init.org::*Restart-emacs%20config][Restart-emacs config:1]]
(use-package restart-emacs :ensure t)
;; Restart-emacs config:1 ends here

;; [[file:~/.emacs.d/init.org::*Fin][Fin:1]]
(unless (server-running-p) (server-start))
;; Fin:1 ends here

;; [[file:~/.emacs.d/init.org::*Fin][Fin:2]]
(setq Don t    ;allows `eval-buffer' on *scratch*
      Panic t  ;with `initial-scratch-message'
      initial-scratch-message
       (concat (propertize "Don't\nPanic\n"
                   'font-lock-face '(:height 10.0 :inherit variable-pitch))
               "\n")) ;newline makes inserted text normal-sized
;;; .emacs.el ends here
;; Fin:2 ends here

;; [[file:~/.emacs.d/init.org::*Fin][Fin:3]]
(message "All done, %s%s" (user-login-name) ".")
;; Fin:3 ends here
